cfg/Documents/ПредварительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПредварительныеНачисления</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоощрениеВзысканиеОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжемесячноеРезервирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выплачено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредварительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/Documents/ПредварительныеНачисления/Ext/ObjectModule.bsl
// ЗаполнитьОсновныеНачисления
//
Процедура ЗаполнитьОсновныеНачисления() Экспорт
	ОсновныеНачисления.Очистить();
	Для каждого лСтрока Из ПредварительныеНачисления Цикл
		Если НачалоМесяца(лСтрока.ДатаНачала) = НачалоМесяца(лСтрока.ДатаОкончания) Тогда
			// Ничего делать не нужно. Просто скопировать строку
			лНоваяСтрока = ОсновныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(лНоваяСтрока, лСтрока);
		Иначе
			лИнтервалВСекундах = (КонецДня(лСтрока.ДатаОкончания) - НачалоДня(лСтрока.ДатаНачала));
			лНачалоПериода = НачалоДня(лСтрока.ДатаНачала);
			лКонецПериода = КонецМесяца(лНачалоПериода);
			лСуммаВсего = лСтрока.Сумма;
			
			лНоваяСтрока = ОсновныеНачисления.Добавить();
			лНоваяСтрока.Сотрудник = лСтрока.Сотрудник;
			лНоваяСтрока.Валюта = лСтрока.Валюта;
			лНоваяСтрока.ДатаНачисления = лСтрока.ДатаНачисления;
			лНоваяСтрока.ДатаНачала = лНачалоПериода;
			лНоваяСтрока.ДатаОкончания = лКонецПериода;
			лСуммаТут = Окр(лСтрока.Сумма * (лКонецПериода - лНачалоПериода) / лИнтервалВСекундах, 2);
			лНоваяСтрока.Сумма = лСуммаТут;
			лСуммаВсего = лСуммаВсего - лСуммаТут;
			Пока лКонецПериода < КонецДня(лСтрока.ДатаОкончания) Цикл
				лНачалоПериода = НачалоДня(КонецМесяца(лНачалоПериода)+1);
				лКонецПериода = Мин(КонецМесяца(лНачалоПериода), КонецДня(лСтрока.ДатаОкончания));
				лНоваяСтрока = ОсновныеНачисления.Добавить();
				лНоваяСтрока.Сотрудник = лСтрока.Сотрудник;
				лНоваяСтрока.Валюта = лСтрока.Валюта;
				лНоваяСтрока.ДатаНачисления = лСтрока.ДатаНачисления;
				лНоваяСтрока.ДатаНачала = лНачалоПериода;
				лНоваяСтрока.ДатаОкончания = лКонецПериода;
				лСуммаТут = Окр(лСтрока.Сумма * (лКонецПериода - лНачалоПериода) / лИнтервалВСекундах, 2);
				лНоваяСтрока.Сумма = лСуммаТут;
				лСуммаВсего = лСуммаВсего - лСуммаТут;
			КонецЦикла;
			Если Не (лСуммаВсего = 0) Тогда
				// Исправим ошибку округления
				ОсновныеНачисления[ ОсновныеНачисления.Количество()-1 ].Сумма = ОсновныеНачисления[ ОсновныеНачисления.Количество()-1 ].Сумма + лСуммаВсего;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьОсновныеНачисления

// ОбработкаПроведения
//
Процедура ОбработкаПроведения(Отказ, Режим)
КонецПроцедуры // ОбработкаПроведения()

// ПередЗаписью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;

	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ОсновныеНачисления);
	
	// Проверим, что заполнено поле Валюта в ТЧ ПредварительныеНачисления
	лГривна = Константы.ВалютаРегламентированногоУчета.Получить();
	Для каждого лСтрока Из ПредварительныеНачисления Цикл
		Если Не ЗначениеЗаполнено(лСтрока.Валюта) Тогда лСтрока.Валюта = лГривна; КонецЕсли;
	КонецЦикла;
	Для каждого лСтрока Из ОсновныеНачисления Цикл
		Если Не ЗначениеЗаполнено(лСтрока.Валюта) Тогда лСтрока.Валюта = лГривна; КонецЕсли;
	КонецЦикла;
	
	Если Не ПредварительныеНачисления.Итог("Сумма") = ОсновныеНачисления.Итог("Сумма") Тогда
		// Нужно перезаполнить ТЧ ОсновныеНачисления по ТЧ ПредварительныеНачисления
		ЗаполнитьОсновныеНачисления();
	КонецЕсли;
КонецПроцедуры // ПередЗаписью()
